{
  "B1f2": 59036,
  "B1h3": 61948,
  "B3f2": 62122,
  "B5b6": 54846,
  "B7d4": 60987,
  "B8c7": 56268,
  "B8f6": 59844,
  "Ba1": 50633,
  "Ba1#": 58118,
  "Ba1+": 61670,
  "Ba2": 53996,
  "Ba2#": 54780,
  "Ba2+": 51309,
  "Ba3": 58373,
  "Ba3#": 53276,
  "Ba3+": 50677,
  "Ba4": 54170,
  "Ba4#": 52513,
  "Ba4+": 60072,
  "Ba5": 53611,
  "Ba5#": 52369,
  "Ba5+": 57880,
  "Ba6": 60424,
  "Ba6#": 51795,
  "Ba6+": 51337,
  "Ba7": 53067,
  "Ba7#": 51247,
  "Ba7+": 50987,
  "Ba8": 55093,
  "Ba8#": 59018,
  "Ba8+": 54727,
  "Bac3+": 56780,
  "Bad4": 55916,
  "Bad4+": 56076,
  "Bad5": 54650,
  "Bae1": 58887,
  "Bae4#": 57828,
  "Bb1": 61930,
  "Bb1#": 55118,
  "Bb1+": 55948,
  "Bb2": 61699,
  "Bb2#": 58041,
  "Bb2+": 61171,
  "Bb3": 53369,
  "Bb3#": 54343,
  "Bb3+": 60451,
  "Bb4": 57214,
  "Bb4#": 59299,
  "Bb4+": 59899,
  "Bb5": 60076,
  "Bb5#": 58377,
  "Bb5+": 61959,
  "Bb6": 56095,
  "Bb6#": 59512,
  "Bb6+": 52402,
  "Bb7": 62041,
  "Bb7#": 50798,
  "Bb7+": 55718,
  "Bb8": 52218,
  "Bb8#": 59958,
  "Bb8+": 55713,
  "Bba3": 55690,
  "Bbc3": 56410,
  "Bbc3#": 52456,
  "Bbc6#": 56341,
  "Bbd4": 57638,
  "Bbd6": 50455,
  "Bbe4": 60493,
  "Bbe4+": 51539,
  "Bbf5": 51129,
  "Bc1": 57681,
  "Bc1#": 54986,
  "Bc1+": 58670,
  "Bc2": 54449,
  "Bc2#": 52383,
  "Bc2+": 54114,
  "Bc3": 53425,
  "Bc3#": 60138,
  "Bc3+": 60664,
  "Bc4": 52205,
  "Bc4#": 53858,
  "Bc4+": 59588,
  "Bc5": 59918,
  "Bc5#": 52599,
  "Bc5+": 58814,
  "Bc6": 56926,
  "Bc6#": 52629,
  "Bc6+": 51609,
  "Bc7": 53958,
  "Bc7#": 56514,
  "Bc7+": 50908,
  "Bc8": 53773,
  "Bc8#": 50992,
  "Bc8+": 52714,
  "Bcd2": 53209,
  "Bcf5+": 53527,
  "Bd1": 51056,
  "Bd1#": 58238,
  "Bd1+": 55708,
  "Bd2": 51191,
  "Bd2#": 58505,
  "Bd2+": 56554,
  "Bd3": 51295,
  "Bd3#": 52677,
  "Bd3+": 58633,
  "Bd4": 59146,
  "Bd4#": 57875,
  "Bd4+": 61816,
  "Bd5": 60949,
  "Bd5#": 58187,
  "Bd5+": 53105,
  "Bd6": 50952,
  "Bd6#": 61782,
  "Bd6+": 60382,
  "Bd7": 61487,
  "Bd7#": 60623,
  "Bd7+": 51794,
  "Bd8": 59859,
  "Bd8#": 50314,
  "Bd8+": 51166,
  "Bdb7": 55967,
  "Bdc7": 54710,
  "Bde2": 52230,
  "Bde4+": 52548,
  "Bde6": 52554,
  "Bdf2": 61764,
  "Bdf3": 51360,
  "Bdf6+": 55598,
  "Bdg3": 55893,
  "Be1": 51526,
  "Be1#": 55250,
  "Be1+": 58606,
  "Be2": 60647,
  "Be2#": 52869,
  "Be2+": 59276,
  "Be3": 58616,
  "Be3#": 58315,
  "Be3+": 51597,
  "Be4": 56778,
  "Be4#": 52520,
  "Be4+": 51556,
  "Be5": 59417,
  "Be5#": 58580,
  "Be5+": 56320,
  "Be6": 61455,
  "Be6#": 60573,
  "Be6+": 60689,
  "Be7": 60093,
  "Be7#": 55198,
  "Be7+": 62146,
  "Be8": 54664,
  "Be8#": 61463,
  "Be8+": 58185,
  "Beb8": 53294,
  "Bed2": 56998,
  "Bed2+": 52071,
  "Bed7": 61632,
  "Bef2": 52611,
  "Bef2+": 59051,
  "Bef3": 56932,
  "Bef4": 53119,
  "Bef5": 54757,
  "Beh2": 51889,
  "Bexc6": 56580,
  "Bf1": 55982,
  "Bf1#": 56968,
  "Bf1+": 59039,
  "Bf2": 58690,
  "Bf2#": 55032,
  "Bf2+": 59769,
  "Bf3": 50306,
  "Bf3#": 60210,
  "Bf3+": 60775,
  "Bf4": 61819,
  "Bf4#": 55683,
  "Bf4+": 56276,
  "Bf5": 59874,
  "Bf5#": 52046,
  "Bf5+": 60139,
  "Bf6": 54383,
  "Bf6#": 52068,
  "Bf6+": 50418,
  "Bf7": 51523,
  "Bf7#": 61283,
  "Bf7+": 58453,
  "Bf8": 51849,
  "Bf8#": 61975,
  "Bf8+": 55658,
  "Bfd4": 58574,
  "Bfe1": 62124,
  "Bfe2+": 58091,
  "Bfe5": 60930,
  "Bfe6+": 57476,
  "Bfg2": 58203,
  "Bfg4": 56060,
  "Bfg5": 60330,
  "Bg1": 57883,
  "Bg1#": 61889,
  "Bg1+": 52428,
  "Bg2": 56941,
  "Bg2#": 55799,
  "Bg2+": 58707,
  "Bg3": 55989,
  "Bg3#": 55606,
  "Bg3+": 56543,
  "Bg4": 50619,
  "Bg4#": 52384,
  "Bg4+": 56552,
  "Bg5": 62075,
  "Bg5#": 50592,
  "Bg5+": 58292,
  "Bg6": 59529,
  "Bg6#": 61410,
  "Bg6+": 54102,
  "Bg7": 61419,
  "Bg7#": 53517,
  "Bg7+": 52492,
  "Bg8": 51821,
  "Bg8#": 61786,
  "Bg8+": 59617,
  "Bgc4": 58487,
  "Bgd5": 61781,
  "Bge3": 56448,
  "Bgf2": 57266,
  "Bgf3": 50623,
  "Bgf6": 59773,
  "Bgf7": 60454,
  "Bh1": 58848,
  "Bh1#": 61376,
  "Bh1+": 55590,
  "Bh2": 56483,
  "Bh2#": 53296,
  "Bh2+": 56574,
  "Bh3": 57359,
  "Bh3#": 59302,
  "Bh3+": 56164,
  "Bh4": 56065,
  "Bh4#": 50343,
  "Bh4+": 51457,
  "Bh5": 58851,
  "Bh5#": 61740,
  "Bh5+": 62119,
  "Bh6": 57284,
  "Bh6#": 51114,
  "Bh6+": 51095,
  "Bh7": 56628,
  "Bh7#": 59156,
  "Bh7+": 56329,
  "Bh8": 56953,
  "Bh8#": 52835,
  "Bh8+": 60064,
  "Bhd3": 58398,
  "Bhd5": 50502,
  "Bhe4+": 57618,
  "Bhf3+": 60727,
  "Bhf6": 56312,
  "Bhg2": 53492,
  "Bhg3": 50521,
  "Bhg7": 54486,
  "Bhg7#": 57953,
  "Bxa1": 50687,
  "Bxa1#": 51715,
  "Bxa1+": 58579,
  "Bxa2": 58087,
  "Bxa2#": 57615,
  "Bxa2+": 57686,
  "Bxa3": 51301,
  "Bxa3#": 60221,
  "Bxa3+": 53668,
  "Bxa4": 56456,
  "Bxa4#": 54016,
  "Bxa4+": 54467,
  "Bxa5": 59986,
  "Bxa5#": 57279,
  "Bxa5+": 54130,
  "Bxa6": 57861,
  "Bxa6#": 56369,
  "Bxa6+": 56792,
  "Bxa7": 53439,
  "Bxa7#": 54080,
  "Bxa7+": 54712,
  "Bxa8": 55465,
  "Bxa8+": 55876,
  "Bxb1": 59003,
  "Bxb1#": 52420,
  "Bxb1+": 56832,
  "Bxb2": 57070,
  "Bxb2#": 56849,
  "Bxb2+": 59635,
  "Bxb3": 56167,
  "Bxb3#": 54994,
  "Bxb3+": 56249,
  "Bxb4": 59448,
  "Bxb4#": 54106,
  "Bxb4+": 62105,
  "Bxb5": 54154,
  "Bxb5#": 55030,
  "Bxb5+": 58652,
  "Bxb6": 54886,
  "Bxb6#": 59114,
  "Bxb6+": 50422,
  "Bxb7": 54470,
  "Bxb7#": 55830,
  "Bxb7+": 52746,
  "Bxb8": 53868,
  "Bxb8#": 54134,
  "Bxb8+": 59353,
  "Bxc1": 55892,
  "Bxc1#": 61675,
  "Bxc1+": 54997,
  "Bxc2": 61475,
  "Bxc2#": 57739,
  "Bxc2+": 50285,
  "Bxc3": 54169,
  "Bxc3#": 60872,
  "Bxc3+": 52320,
  "Bxc4": 59232,
  "Bxc4#": 60419,
  "Bxc4+": 54714,
  "Bxc5": 53745,
  "Bxc5#": 50399,
  "Bxc5+": 51585,
  "Bxc6": 57454,
  "Bxc6#": 57906,
  "Bxc6+": 55997,
  "Bxc7": 60844,
  "Bxc7#": 55160,
  "Bxc7+": 59782,
  "Bxc8": 50805,
  "Bxc8#": 53190,
  "Bxc8+": 51416,
  "Bxd1": 57252,
  "Bxd1#": 57201,
  "Bxd1+": 61598,
  "Bxd2": 52241,
  "Bxd2#": 60480,
  "Bxd2+": 61713,
  "Bxd3": 59728,
  "Bxd3#": 58601,
  "Bxd3+": 53480,
  "Bxd4": 56881,
  "Bxd4#": 59286,
  "Bxd4+": 53386,
  "Bxd5": 58610,
  "Bxd5#": 52179,
  "Bxd5+": 54974,
  "Bxd6": 53803,
  "Bxd6#": 57397,
  "Bxd6+": 60006,
  "Bxd7": 54057,
  "Bxd7#": 60202,
  "Bxd7+": 58801,
  "Bxd8": 53069,
  "Bxd8#": 54460,
  "Bxd8+": 59088,
  "Bxe1": 52286,
  "Bxe1#": 52007,
  "Bxe1+": 59323,
  "Bxe2": 55797,
  "Bxe2#": 61409,
  "Bxe2+": 61479,
  "Bxe3": 54070,
  "Bxe3#": 61378,
  "Bxe3+": 53918,
  "Bxe4": 56544,
  "Bxe4#": 56991,
  "Bxe4+": 61016,
  "Bxe5": 52689,
  "Bxe5#": 51496,
  "Bxe5+": 58336,
  "Bxe6": 56874,
  "Bxe6#": 55589,
  "Bxe6+": 61467,
  "Bxe7": 55773,
  "Bxe7#": 52302,
  "Bxe7+": 55814,
  "Bxe8": 52649,
  "Bxe8#": 53547,
  "Bxe8+": 52582,
  "Bxf1": 51824,
  "Bxf1#": 56286,
  "Bxf1+": 59796,
  "Bxf2": 57015,
  "Bxf2#": 57745,
  "Bxf2+": 50354,
  "Bxf3": 54823,
  "Bxf3#": 55110,
  "Bxf3+": 60603,
  "Bxf4": 51369,
  "Bxf4#": 56457,
  "Bxf4+": 61333,
  "Bxf5": 53082,
  "Bxf5#": 54917,
  "Bxf5+": 51828,
  "Bxf6": 55365,
  "Bxf6#": 59076,
  "Bxf6+": 51034,
  "Bxf7": 59491,
  "Bxf7#": 58988,
  "Bxf7+": 51900,
  "Bxf8": 57822,
  "Bxf8#": 61407,
  "Bxf8+": 51911,
  "Bxg1": 61701,
  "Bxg1+": 61979,
  "Bxg2": 52628,
  "Bxg2#": 59888,
  "Bxg2+": 59298,
  "Bxg3": 50758,
  "Bxg3#": 55180,
  "Bxg3+": 54116,
  "Bxg4": 50601,
  "Bxg4#": 54200,
  "Bxg4+": 54142,
  "Bxg5": 57194,
  "Bxg5#": 60287,
  "Bxg5+": 55777,
  "Bxg6": 60083,
  "Bxg6#": 56798,
  "Bxg6+": 53519,
  "Bxg7": 51573,
  "Bxg7#": 61768,
  "Bxg7+": 52815,
  "Bxg8": 61288,
  "Bxg8#": 52896,
  "Bxg8+": 55714,
  "Bxh1": 50985,
  "Bxh1+": 54548,
  "Bxh2": 56425,
  "Bxh2#": 51566,
  "Bxh2+": 58634,
  "Bxh3": 54975,
  "Bxh3#": 52690,
  "Bxh3+": 56795,
  "Bxh4": 50535,
  "Bxh4#": 56392,
  "Bxh4+": 61033,
  "Bxh5": 58917,
  "Bxh5#": 60001,
  "Bxh5+": 59610,
  "Bxh6": 51531,
  "Bxh6#": 55339,
  "Bxh6+": 51110,
  "Bxh7": 54892,
  "Bxh7#": 57164,
  "Bxh7+": 54422,
  "Bxh8": 60899,
  "Bxh8+": 55317,
  "Ka1": 59934,
  "Ka1+": 61820,
  "Ka2": 53315,
  "Ka2#": 60309,
  "Ka2+": 54406,
  "Ka3": 56903,
  "Ka3+": 53138,
  "Ka4": 60232,
  "Ka4+": 60363,
  "Ka5": 52262,
  "Ka5+": 52843,
  "Ka6": 54750,
  "Ka6+": 53783,
  "Ka7": 56195,
  "Ka7#": 58873,
  "Ka7+": 58448,
  "Ka8": 54907,
  "Ka8+": 55330,
  "Kb1": 56984,
  "Kb1#": 51532,
  "Kb1+": 58729,
  "Kb2": 53196,
  "Kb2#": 52640,
  "Kb2+": 55680,
  "Kb3": 60782,
  "Kb3#": 51887,
  "Kb3+": 57936,
  "Kb4": 52707,
  "Kb4#": 52418,
  "Kb4+": 52946,
  "Kb5": 61272,
  "Kb5#": 61595,
  "Kb5+": 62100,
  "Kb6": 54744,
  "Kb6+": 58074,
  "Kb7": 54236,
  "Kb7#": 59488,
  "Kb7+": 54096,
  "Kb8": 56254,
  "Kb8#": 61678,
  "Kb8+": 55785,
  "Kc1": 54027,
  "Kc1+": 57170,
  "Kc2": 51287,
  "Kc2#": 57059,
  "Kc2+": 50936,
  "Kc3": 51426,
  "Kc3#": 51020,
  "Kc3+": 56110,
  "Kc4": 54951,
  "Kc4#": 56203,
  "Kc4+": 54024,
  "Kc5": 56569,
  "Kc5#": 53203,
  "Kc5+": 57726,
  "Kc6": 52809,
  "Kc6#": 51838,
  "Kc6+": 57080,
  "Kc7": 51279,
  "Kc7#": 50942,
  "Kc7+": 61418,
  "Kc8": 56176,
  "Kc8+": 52631,
  "Kd1": 52770,
  "Kd1+": 52054,
  "Kd2": 56185,
  "Kd2#": 52871,
  "Kd2+": 56030,
  "Kd3": 57607,
  "Kd3+": 51861,
  "Kd4": 51953,
  "Kd4+": 51837,
  "Kd5": 58183,
  "Kd5+": 52925,
  "Kd6": 57314,
  "Kd6#": 61069,
  "Kd6+": 57949,
  "Kd7": 51459,
  "Kd7#": 51864,
  "Kd7+": 50341,
  "Kd8": 57407,
  "Kd8+": 61925,
  "Ke1": 60163,
  "Ke1+": 61592,
  "Ke2": 60865,
  "Ke2#": 52537,
  "Ke2+": 57431,
  "Ke3": 59587,
  "Ke3#": 52836,
  "Ke3+": 61496,
  "Ke4": 50522,
  "Ke4#": 55200,
  "Ke4+": 54789,
  "Ke5": 55413,
  "Ke5#": 52481,
  "Ke5+": 50803,
  "Ke6": 50990,
  "Ke6#": 58476,
  "Ke6+": 57308,
  "Ke7": 61235,
  "Ke7#": 51172,
  "Ke7+": 56124,
  "Ke8": 55984,
  "Ke8#": 51336,
  "Ke8+": 55947,
  "Kf1": 51373,
  "Kf1#": 59805,
  "Kf1+": 61602,
  "Kf2": 52974,
  "Kf2#": 54767,
  "Kf2+": 50681,
  "Kf3": 52117,
  "Kf3#": 52912,
  "Kf3+": 52750,
  "Kf4": 57448,
  "Kf4+": 61230,
  "Kf5": 59000,
  "Kf5#": 56143,
  "Kf5+": 52817,
  "Kf6": 53379,
  "Kf6#": 53284,
  "Kf6+": 60545,
  "Kf7": 59464,
  "Kf7#": 52892,
  "Kf7+": 60737,
  "Kf8": 59855,
  "Kf8#": 50643,
  "Kf8+": 52883,
  "Kg1": 60199,
  "Kg1#": 58951,
  "Kg1+": 59341,
  "Kg2": 61839,
  "Kg2#": 56556,
  "Kg2+": 61864,
  "Kg3": 51903,
  "Kg3#": 55719,
  "Kg3+": 50680,
  "Kg4": 52650,
  "Kg4#": 53477,
  "Kg4+": 56355,
  "Kg5": 50366,
  "Kg5#": 57814,
  "Kg5+": 51542,
  "Kg6": 60789,
  "Kg6#": 52907,
  "Kg6+": 51860,
  "Kg7": 57578,
  "Kg7#": 59375,
  "Kg7+": 59248,
  "Kg8": 60321,
  "Kg8#": 51501,
  "Kg8+": 54942,
  "Kh1": 57471,
  "Kh1+": 53605,
  "Kh2": 53187,
  "Kh2#": 55478,
  "Kh2+": 61909,
  "Kh3": 61550,
  "Kh3+": 60554,
  "Kh4": 57813,
  "Kh4+": 59607,
  "Kh5": 53470,
  "Kh5+": 52406,
  "Kh6": 52655,
  "Kh6#": 60207,
  "Kh6+": 52380,
  "Kh7": 50509,
  "Kh7#": 54271,
  "Kh7+": 54178,
  "Kh8": 61741,
  "Kh8+": 51165,
  "Kxa1": 50731,
  "Kxa2": 55622,
  "Kxa3": 59210,
  "Kxa3+": 50550,
  "Kxa4": 55502,
  "Kxa4+": 61382,
  "Kxa5": 57320,
  "Kxa6": 58991,
  "Kxa7": 60814,
  "Kxa7+": 51398,
  "Kxa8": 50789,
  "Kxb1": 51493,
  "Kxb2": 57094,
  "Kxb2+": 54784,
  "Kxb3": 55979,
  "Kxb3+": 56471,
  "Kxb4": 61173,
  "Kxb4+": 57689,
  "Kxb5": 54674,
  "Kxb5+": 59091,
  "Kxb6": 58608,
  "Kxb6#": 52658,
  "Kxb6+": 55618,
  "Kxb7": 52991,
  "Kxb8": 56367,
  "Kxc1": 59613,
  "Kxc2": 59753,
  "Kxc2+": 51189,
  "Kxc3": 51005,
  "Kxc3+": 59774,
  "Kxc4": 56711,
  "Kxc4+": 61989,
  "Kxc5": 60284,
  "Kxc5+": 50860,
  "Kxc6": 53391,
  "Kxc6+": 56008,
  "Kxc7": 59149,
  "Kxc7+": 61195,
  "Kxc8": 51778,
  "Kxd1": 56834,
  "Kxd1+": 50501,
  "Kxd2": 52768,
  "Kxd2#": 51755,
  "Kxd3": 54800,
  "Kxd3+": 55932,
  "Kxd4": 58583,
  "Kxd4+": 57789,
  "Kxd5": 50275,
  "Kxd5+": 57824,
  "Kxd6": 60117,
  "Kxd6+": 61679,
  "Kxd7": 55414,
  "Kxd7+": 55639,
  "Kxd8": 54450,
  "Kxd8+": 52204,
  "Kxe1": 54259,
  "Kxe1+": 52757,
  "Kxe2": 57507,
  "Kxe2+": 53545,
  "Kxe3": 52657,
  "Kxe3+": 60222,
  "Kxe4": 55327,
  "Kxe4+": 53241,
  "Kxe5": 56128,
  "Kxe5+": 58030,
  "Kxe6": 53133,
  "Kxe6#": 50826,
  "Kxe6+": 61831,
  "Kxe7": 57187,
  "Kxe8": 54717,
  "Kxe8+": 59304,
  "Kxf1": 60901,
  "Kxf2": 59287,
  "Kxf2+": 51880,
  "Kxf3": 59422,
  "Kxf3+": 53065,
  "Kxf4": 50596,
  "Kxf4+": 53774,
  "Kxf5": 59478,
  "Kxf5+": 57637,
  "Kxf6": 53501,
  "Kxf6+": 51367,
  "Kxf7": 53189,
  "Kxf7#": 51902,
  "Kxf7+": 54088,
  "Kxf8": 55837,
  "Kxg1": 54384,
  "Kxg2": 57159,
  "Kxg2+": 53698,
  "Kxg3": 51862,
  "Kxg3#": 53469,
  "Kxg3+": 52158,
  "Kxg4": 54511,
  "Kxg4+": 56075,
  "Kxg5": 60593,
  "Kxg5+": 52676,
  "Kxg6": 52125,
  "Kxg6+": 52879,
  "Kxg7": 58410,
  "Kxg7+": 50821,
  "Kxg8": 55323,
  "Kxh1": 53140,
  "Kxh2": 53433,
  "Kxh2+": 59547,
  "Kxh3": 61992,
  "Kxh3#": 56288,
  "Kxh3+": 60411,
  "Kxh4": 59148,
  "Kxh4+": 59219,
  "Kxh5": 58708,
  "Kxh5+": 53186,
  "Kxh6": 52122,
  "Kxh6+": 56769,
  "Kxh7": 60556,
  "Kxh7+": 57088,
  "Kxh8": 55753,
  "N1a2": 55416,
  "N1a3": 59274,
  "N1b2": 56147,
  "N1b3": 52307,
  "N1b3+": 59332,
  "N1c2": 59100,
  "N1c3": 51979,
  "N1c3+": 59676,
  "N1d2": 59560,
  "N1d2+": 57525,
  "N1d3": 61805,
  "N1e2": 53646,
  "N1e2+": 56960,
  "N1e3": 59655,
  "N1f2": 50548,
  "N1f2#": 56253,
  "N1f2+": 56571,
  "N1f3": 58936,
  "N1f3+": 54121,
  "N1g2": 53076,
  "N1g3": 55485,
  "N1h2": 55584,
  "N1h3": 53239,
  "N1xa3": 52423,
  "N1xb2": 50669,
  "N1xb3": 52014,
  "N1xc2": 55149,
  "N1xc3": 50622,
  "N1xd2": 56623,
  "N1xd3": 51519,
  "N1xe2": 60612,
  "N1xe3": 52288,
  "N1xe3+": 53086,
  "N1xf2": 58092,
  "N1xf3": 61355,
  "N1xf3+": 56104,
  "N1xg2": 51190,
  "N1xg3": 56088,
  "N1xh2": 59042,
  "N1xh3": 54064,
  "N2a3": 59440,
  "N2a3+": 62036,
  "N2a4": 54933,
  "N2a4+": 57282,
  "N2b3": 57087,
  "N2b3+": 54857,
  "N2b4": 60171,
  "N2c3": 55769,
  "N2c3+": 56344,
  "N2c4": 57965,
  "N2d3": 56339,
  "N2d3+": 54250,
  "N2d4": 54241,
  "N2d4+": 61918,
  "N2e3": 55682,
  "N2e3+": 59939,
  "N2e4": 61497,
  "N2e4#": 50732,
  "N2e4+": 53811,
  "N2f3": 61921,
  "N2f3+": 52999,
  "N2f4": 62026,
  "N2f4+": 53381,
  "N2g3": 50693,
  "N2g3+": 57172,
  "N2g4": 61829,
  "N2g4#": 55818,
  "N2g4+": 50493,
  "N2h3": 57138,
  "N2h3+": 52680,
  "N2h4": 53972,
  "N2xa4": 54545,
  "N2xb3": 58897,
  "N2xc3": 59629,
  "N2xc3+": 58007,
  "N2xc4": 56678,
  "N2xc4+": 57777,
  "N2xd3": 50814,
  "N2xd4": 57188,
  "N2xd4+": 55857,
  "N2xe3": 58267,
  "N2xe3+": 60085,
  "N2xe4": 53036,
  "N2xe4+": 58282,
  "N2xf3": 61268,
  "N2xf3+": 58984,
  "N2xf4": 50937,
  "N2xg3": 59830,
  "N2xg3+": 57879,
  "N2xh3": 55705,
  "N3a2": 51322,
  "N3a4": 58461,
  "N3a4+": 55474,
  "N3a5": 61374,
  "N3b2": 56435,
  "N3b4": 58761,
  "N3b4+": 51986,
  "N3b5": 60065,
  "N3b5+": 60969,
  "N3c2": 57682,
  "N3c4": 60859,
  "N3c4+": 62112,
  "N3c5": 53630,
  "N3c5+": 55704,
  "N3d2": 56031,
  "N3d4": 56182,
  "N3d4#": 58113,
  "N3d4+": 52036,
  "N3d5": 50430,
  "N3d5#": 56153,
  "N3d5+": 59520,
  "N3e2": 51629,
  "N3e4": 55949,
  "N3e4#": 53235,
  "N3e4+": 58140,
  "N3e5": 56559,
  "N3e5+": 58793,
  "N3f2": 52765,
  "N3f2+": 51022,
  "N3f4": 57440,
  "N3f4+": 54772,
  "N3f5": 60011,
  "N3f5+": 55783,
  "N3g2": 57202,
  "N3g4": 54052,
  "N3g4+": 53534,
  "N3g5": 61972,
  "N3g5+": 61253,
  "N3h2": 59205,
  "N3h4": 56676,
  "N3h4+": 50888,
  "N3h5": 51619,
  "N3xa4": 55722,
  "N3xb2": 61512,
  "N3xb4": 59186,
  "N3xb5": 52381,
  "N3xc4": 56073,
  "N3xc4+": 59294,
  "N3xc5": 57230,
  "N3xc5+": 55117,
  "N3xd2": 52152,
  "N3xd4": 54737,
  "N3xd4+": 54476,
  "N3xd5": 51103,
  "N3xe2": 58285,
  "N3xe4": 54581,
  "N3xe4+": 54621,
  "N3xe5": 58890,
  "N3xe5+": 50327,
  "N3xf2": 50452,
  "N3xf4": 58798,
  "N3xf4+": 59779,
  "N3xf5": 52732,
  "N3xf5+": 51792,
  "N3xg4": 55986,
  "N3xg4+": 55544,
  "N3xg5": 58446,
  "N3xg5+": 54662,
  "N3xh2": 50674,
  "N3xh4": 59419,
  "N3xh4+": 52051,
  "N3xh5": 51385,
  "N4a3": 56175,
  "N4a5": 59320,
  "N4a5+": 53743,
  "N4a6": 51791,
  "N4b3": 58081,
  "N4b5": 60523,
  "N4b5+": 50414,
  "N4b6": 54952,
  "N4c3": 52026,
  "N4c3+": 59161,
  "N4c5": 61533,
  "N4c5+": 51547,
  "N4c6": 60522,
  "N4d3": 53182,
  "N4d3+": 50882,
  "N4d5": 61767,
  "N4d5+": 54513,
  "N4d6": 55382,
  "N4e3": 59191,
  "N4e3#": 51132,
  "N4e3+": 61099,
  "N4e5": 59289,
  "N4e5+": 61642,
  "N4e6": 60601,
  "N4f3": 52591,
  "N4f3+": 53835,
  "N4f5": 51767,
  "N4f5+": 59827,
  "N4f6": 56332,
  "N4f6+": 55275,
  "N4g3": 57534,
  "N4g3#": 58800,
  "N4g3+": 53562,
  "N4g5": 54534,
  "N4g5#": 61614,
  "N4g5+": 56920,
  "N4g6": 52662,
  "N4g6#": 52918,
  "N4g6+": 60747,
  "N4h3": 60496,
  "N4h3+": 56981,
  "N4h5": 55732,
  "N4h5+": 57843,
  "N4h6": 53051,
  "N4xa3": 57613,
  "N4xa5": 54028,
  "N4xa5+": 50518,
  "N4xa6": 59962,
  "N4xb3": 55636,
  "N4xb5": 54852,
  "N4xb5+": 54013,
  "N4xb6": 53594,
  "N4xc3": 56135,
  "N4xc5": 55522,
  "N4xd5": 53842,
  "N4xd5+": 54401,
  "N4xd6": 59130,
  "N4xe3": 60711,
  "N4xe5": 56717,
  "N4xf3": 55587,
  "N4xf5": 60476,
  "N4xf5+": 54851,
  "N4xf6": 60074,
  "N4xg3": 50325,
  "N4xg3#": 52044,
  "N4xg3+": 61945,
  "N4xg5": 56799,
  "N4xg5+": 53006,
  "N4xh3": 61074,
  "N4xh5": 61310,
  "N4xh5+": 61395,
  "N4xh6": 55974,
  "N5a3": 60103,
  "N5a4": 52865,
  "N5a4+": 51698,
  "N5a6": 51766,
  "N5a6+": 61331,
  "N5b3": 58751,
  "N5b4": 51580,
  "N5b4+": 51661,
  "N5b6": 60293,
  "N5b6+": 59663,
  "N5c3": 61761,
  "N5c4": 58668,
  "N5c4#": 50911,
  "N5c4+": 61810,
  "N5c6": 53982,
  "N5c6+": 50997,
  "N5d3": 57632,
  "N5d3+": 60150,
  "N5d4": 53285,
  "N5d4#": 56760,
  "N5d4+": 60193,
  "N5d6": 55098,
  "N5d6+": 55440,
  "N5e3": 55518,
  "N5e3+": 55926,
  "N5e4": 57405,
  "N5e4+": 60446,
  "N5e6": 54060,
  "N5e6#": 60443,
  "N5e6+": 52834,
  "N5f3": 61224,
  "N5f3+": 60912,
  "N5f4": 51168,
  "N5f4+": 51883,
  "N5f6": 61867,
  "N5f6+": 54671,
  "N5g3": 55694,
  "N5g3#": 56226,
  "N5g4": 54828,
  "N5g4+": 52897,
  "N5g6": 54418,
  "N5g6#": 54766,
  "N5g6+": 60272,
  "N5h3": 52214,
  "N5h4": 59493,
  "N5h4#": 53551,
  "N5h4+": 55581,
  "N5h6": 61144,
  "N5h6#": 56611,
  "N5h6+": 52168,
  "N5xa3": 59486,
  "N5xa4": 58136,
  "N5xa4+": 53329,
  "N5xa6": 57039,
  "N5xb3": 57690,
  "N5xb4": 59373,
  "N5xb6": 62072,
  "N5xb6#": 60622,
  "N5xc3": 52290,
  "N5xc4": 53533,
  "N5xc4+": 58479,
  "N5xc6": 57996,
  "N5xc6+": 51845,
  "N5xd3": 56809,
  "N5xd4": 61161,
  "N5xd4+": 59815,
  "N5xd6": 54991,
  "N5xe3+": 53335,
  "N5xe4": 56915,
  "N5xe4+": 51990,
  "N5xe6": 57273,
  "N5xf3": 58148,
  "N5xf4": 55229,
  "N5xf4+": 52562,
  "N5xf6": 60239,
  "N5xf6+": 54370,
  "N5xg4": 50959,
  "N5xg4+": 52053,
  "N5xg6": 50507,
  "N5xh4": 58703,
  "N5xh6": 51341,
  "N5xh6+": 53286,
  "N6a4": 55736,
  "N6a5": 58688,
  "N6a5+": 51159,
  "N6a7": 51161,
  "N6b4": 58830,
  "N6b5": 56962,
  "N6c4": 60482,
  "N6c4+": 53316,
  "N6c5": 53901,
  "N6c5+": 56025,
  "N6c7": 60354,
  "N6d4": 52816,
  "N6d4+": 56157,
  "N6d5": 53225,
  "N6d5+": 60931,
  "N6d7": 59424,
  "N6d7+": 55376,
  "N6e4": 51362,
  "N6e4+": 61009,
  "N6e5": 61081,
  "N6e5+": 58772,
  "N6e7": 53813,
  "N6e7+": 58578,
  "N6f4": 55113,
  "N6f4#": 51801,
  "N6f4+": 51286,
  "N6f5": 50658,
  "N6f5+": 50733,
  "N6f7": 61011,
  "N6g4": 57655,
  "N6g4#": 61997,
  "N6g4+": 58320,
  "N6g5": 61221,
  "N6g5+": 55287,
  "N6g7": 51822,
  "N6h5": 51254,
  "N6h5+": 60836,
  "N6h7": 58877,
  "N6xa5": 58541,
  "N6xb4": 58420,
  "N6xb5": 55014,
  "N6xb7": 58305,
  "N6xc4": 58096,
  "N6xc5": 55449,
  "N6xc5+": 51223,
  "N6xd4": 60732,
  "N6xd4+": 58820,
  "N6xd5": 61295,
  "N6xd5+": 50809,
  "N6xd7": 59282,
  "N6xe4": 53005,
  "N6xe4+": 58560,
  "N6xe5": 51019,
  "N6xe5+": 61202,
  "N6xe7": 57047,
  "N6xf4": 57055,
  "N6xf4+": 60853,
  "N6xf5": 51980,
  "N6xf5+": 60445,
  "N6xg4": 55056,
  "N6xg5": 51602,
  "N6xg7": 52182,
  "N6xh5": 60515,
  "N6xh5+": 50871,
  "N6xh7": 62123,
  "N7a5": 51054,
  "N7a6": 50656,
  "N7a6+": 60089,
  "N7b5": 60769,
  "N7b5+": 53352,
  "N7b6": 50315,
  "N7b6+": 61807,
  "N7c5": 59716,
  "N7c5+": 62147,
  "N7c6": 60619,
  "N7c6#": 58649,
  "N7c6+": 58367,
  "N7d5": 61824,
  "N7d5+": 60848,
  "N7d6": 53887,
  "N7d6+": 51776,
  "N7e5": 55626,
  "N7e5+": 58115,
  "N7e6": 60909,
  "N7e6+": 57051,
  "N7f5": 54067,
  "N7f5#": 61466,
  "N7f5+": 50748,
  "N7f6": 52025,
  "N7f6#": 52947,
  "N7f6+": 54976,
  "N7g5": 61450,
  "N7g5+": 56113,
  "N7g6": 60937,
  "N7g6+": 57672,
  "N7h5": 55394,
  "N7h5+": 57134,
  "N7h6": 56564,
  "N7h6+": 55428,
  "N7xa5": 52534,
  "N7xa6": 58903,
  "N7xb6": 54847,
  "N7xc5": 51083,
  "N7xc6": 55126,
  "N7xc6+": 55183,
  "N7xd5": 54853,
  "N7xd5+": 57175,
  "N7xd6": 55542,
  "N7xd6+": 53752,
  "N7xe5": 61515,
  "N7xe6": 55781,
  "N7xe6+": 61335,
  "N7xf5": 60607,
  "N7xf6": 61348,
  "N7xg5": 57924,
  "N7xg6": 59667,
  "N7xg6+": 52983,
  "N7xh5": 61968,
  "N7xh6": 56693,
  "N7xh6+": 52440,
  "N8a6": 51320,
  "N8a7": 51868,
  "N8b6": 60054,
  "N8b7": 50742,
  "N8c6": 59185,
  "N8c6+": 56644,
  "N8c7": 55463,
  "N8c7#": 58337,
  "N8d6": 51199,
  "N8d6+": 53268,
  "N8d7": 60672,
  "N8d7+": 53929,
  "N8e6": 56100,
  "N8e6+": 57236,
  "N8e7": 52837,
  "N8e7+": 52967,
  "N8f6": 60390,
  "N8f6+": 56354,
  "N8f7": 60611,
  "N8g6": 52137,
  "N8g7": 58783,
  "N8h6": 50424,
  "N8h7": 58409,
  "N8xa6": 53205,
  "N8xb6": 50665,
  "N8xb6+": 52472,
  "N8xc6": 62063,
  "N8xd6": 52724,
  "N8xd7": 59548,
  "N8xe6": 59877,
  "N8xe7": 53506,
  "N8xf6": 51010,
  "N8xf7": 50632,
  "N8xg6": 59813,
  "N8xg7": 59861,
  "N8xh6": 58235,
  "N8xh7": 59495,
  "Na1": 53951,
  "Na1#": 58744,
  "Na1+": 52509,
  "Na2": 53107,
  "Na2#": 58434,
  "Na2+": 52166,
  "Na3": 51847,
  "Na3#": 59359,
  "Na3+": 52908,
  "Na4": 54840,
  "Na4#": 53356,
  "Na4+": 53013,
  "Na5": 54127,
  "Na5#": 54211,
  "Na5+": 58335,
  "Na6": 55642,
  "Na6#": 56282,
  "Na6+": 54393,
  "Na7": 58095,
  "Na7#": 54850,
  "Na7+": 53788,
  "Na8": 53011,
  "Na8+": 50471,
  "Nab1": 52881,
  "Nab2": 53684,
  "Nab2#": 57244,
  "Nab2+": 62081,
  "Nab3": 60370,
  "Nab3+": 62024,
  "Nab4": 51271,
  "Nab4+": 51413,
  "Nab5": 51940,
  "Nab5+": 58124,
  "Nab6": 60403,
  "Nab6#": 57261,
  "Nab6+": 58080,
  "Nab7": 50468,
  "Nab8": 62010,
  "Nac1": 57422,
  "Nac2": 52009,
  "Nac2#": 60231,
  "Nac2+": 61811,
  "Nac3": 56864,
  "Nac3#": 51246,
  "Nac3+": 54585,
  "Nac4": 59966,
  "Nac4#": 56972,
  "Nac4+": 58843,
  "Nac5": 55370,
  "Nac5+": 56429,
  "Nac6": 53445,
  "Nac6+": 56549,
  "Nac7": 58832,
  "Nac7#": 50357,
  "Nac7+": 51139,
  "Nac8": 57893,
  "Naxb2": 51783,
  "Naxb2+": 51920,
  "Naxb3": 61603,
  "Naxb3+": 60353,
  "Naxb4": 55696,
  "Naxb5": 55114,
  "Naxb6": 60045,
  "Naxb6#": 50670,
  "Naxb6+": 55633,
  "Naxb7": 51843,
  "Naxb8": 60412,
  "Naxc1": 56515,
  "Naxc2": 60260,
  "Naxc3": 54938,
  "Naxc3+": 55520,
  "Naxc4": 56997,
  "Naxc4+": 58748,
  "Naxc5": 54119,
  "Naxc5+": 52470,
  "Naxc6": 50590,
  "Naxc6+": 60130,
  "Naxc7": 60916,
  "Naxc7+": 57678,
  "Naxc8": 58773,
  "Nb1": 59965,
  "Nb1#": 52643,
  "Nb1+": 61932,
  "Nb2": 58813,
  "Nb2#": 52480,
  "Nb2+": 53475,
  "Nb3": 54779,
  "Nb3#": 50503,
  "Nb3+": 57478,
  "Nb4": 57329,
  "Nb4#": 53106,
  "Nb4+": 52331,
  "Nb5": 52511,
  "Nb5#": 50476,
  "Nb5+": 59742,
  "Nb6": 53340,
  "Nb6#": 52977,
  "Nb6+": 61651,
  "Nb7": 51437,
  "Nb7#": 51600,
  "Nb7+": 50342,
  "Nb8": 58906,
  "Nb8#": 56788,
  "Nb8+": 51096,
  "Nba1": 60125,
  "Nba2": 56092,
  "Nba2#": 51695,
  "Nba2+": 55794,
  "Nba3": 57862,
  "Nba3+": 54365,
  "Nba4": 59787,
  "Nba4+": 55331,
  "Nba5": 55496,
  "Nba5+": 57547,
  "Nba6": 52610,
  "Nba6#": 54423,
  "Nba6+": 53000,
  "Nba7": 53681,
  "Nba7#": 52121,
  "Nba7+": 52187,
  "Nba8": 60432,
  "Nbc1": 56897,
  "Nbc1+": 61534,
  "Nbc2": 51263,
  "Nbc2#": 53060,
  "Nbc2+": 56291,
  "Nbc3": 60712,
  "Nbc3#": 59218,
  "Nbc3+": 57669,
  "Nbc4": 60876,
  "Nbc4+": 59416,
  "Nbc5": 59987,
  "Nbc5+": 58727,
  "Nbc6": 61773,
  "Nbc6#": 57061,
  "Nbc6+": 52608,
  "Nbc7": 51222,
  "Nbc7+": 56331,
  "Nbc8": 51571,
  "Nbc8+": 57105,
  "Nbd1": 57911,
  "Nbd2": 52950,
  "Nbd2+": 56907,
  "Nbd3": 52414,
  "Nbd3+": 55454,
  "Nbd4": 50526,
  "Nbd4+": 52424,
  "Nbd5": 58072,
  "Nbd5#": 61566,
  "Nbd5+": 59176,
  "Nbd6": 60870,
  "Nbd6#": 54462,
  "Nbd6+": 58764,
  "Nbd7": 56151,
  "Nbd7#": 57074,
  "Nbd7+": 60295,
  "Nbd8": 60040,
  "Nbd8+": 58036,
  "Nbxa2": 62127,
  "Nbxa2#": 57999,
  "Nbxa2+": 56419,
  "Nbxa3": 55036,
  "Nbxa3#": 58193,
  "Nbxa4": 55402,
  "Nbxa5": 59314,
  "Nbxa6": 56908,
  "Nbxa6+": 52283,
  "Nbxa7": 52536,
  "Nbxa7+": 53068,
  "Nbxc1": 54412,
  "Nbxc1+": 56541,
  "Nbxc2": 55687,
  "Nbxc2+": 52500,
  "Nbxc3": 52244,
  "Nbxc4": 52176,
  "Nbxc4+": 59420,
  "Nbxc5": 55640,
  "Nbxc5+": 51785,
  "Nbxc6": 60802,
  "Nbxc6+": 54645,
  "Nbxc7": 58926,
  "Nbxc7+": 50978,
  "Nbxc8": 59850,
  "Nbxd1": 56697,
  "Nbxd2": 51540,
  "Nbxd3": 54668,
  "Nbxd3+": 57718,
  "Nbxd4": 51727,
  "Nbxd4+": 60766,
  "Nbxd5": 51393,
  "Nbxd5+": 52413,
  "Nbxd6": 58456,
  "Nbxd6#": 61157,
  "Nbxd6+": 52282,
  "Nbxd7": 60806,
  "Nc1": 51517,
  "Nc1#": 54725,
  "Nc1+": 55318,
  "Nc2": 55166,
  "Nc2#": 61035,
  "Nc2+": 54778,
  "Nc3": 57346,
  "Nc3#": 52877,
  "Nc3+": 51978,
  "Nc4": 61304,
  "Nc4#": 53380,
  "Nc4+": 59994,
  "Nc5": 50459,
  "Nc5#": 53648,
  "Nc5+": 55214,
  "Nc6": 56613,
  "Nc6#": 60936,
  "Nc6+": 55081,
  "Nc7": 56125,
  "Nc7#": 59571,
  "Nc7+": 53612,
  "Nc8": 58418,
  "Nc8#": 53073,
  "Nc8+": 50960,
  "Nca1": 52246,
  "Nca2": 55870,
  "Nca2+": 54838,
  "Nca3": 56536,
  "Nca3+": 61314,
  "Nca4": 58740,
  "Nca4+": 60886,
  "Nca5": 51352,
  "Nca5+": 57417,
  "Nca6": 54967,
  "Nca7": 51425,
  "Nca7#": 60894,
  "Nca8": 50494,
  "Ncb1": 53431,
  "Ncb1+": 56869,
  "Ncb2": 58899,
  "Ncb2+": 52366,
  "Ncb3": 59414,
  "Ncb3#": 53713,
  "Ncb3+": 51650,
  "Ncb4": 50543,
  "Ncb4#": 53883,
  "Ncb4+": 51674,
  "Ncb5": 56229,
  "Ncb5#": 55222,
  "Ncb5+": 50400,
  "Ncb6": 55441,
  "Ncb6+": 58883,
  "Ncb7": 60586,
  "Ncb7#": 54771,
  "Ncb7+": 61563,
  "Ncb8": 56661,
  "Ncd1": 58642,
  "Ncd2": 59490,
  "Ncd2#": 51106,
  "Ncd2+": 52057,
  "Ncd3": 57217,
  "Ncd3#": 57623,
  "Ncd3+": 51850,
  "Ncd4": 52110,
  "Ncd4+": 56754,
  "Ncd5": 58771,
  "Ncd5#": 51996,
  "Ncd5+": 57742,
  "Ncd6": 54540,
  "Ncd6+": 50473,
  "Ncd7": 61385,
  "Ncd7+": 58676,
  "Ncd8": 61931,
  "Nce1": 61662,
  "Nce1+": 59969,
  "Nce2": 54368,
  "Nce2+": 50447,
  "Nce3": 58462,
  "Nce3+": 54093,
  "Nce4": 51377,
  "Nce4#": 61716,
  "Nce4+": 60470,
  "Nce5": 51935,
  "Nce5+": 50722,
  "Nce6": 54464,
  "Nce6#": 57664,
  "Nce6+": 53919,
  "Nce7": 59506,
  "Nce7#": 55611,
  "Nce7+": 59327,
  "Nce8": 54937,
  "Nce8+": 56913,
  "Ncxa1": 52510,
  "Ncxa2": 53962,
  "Ncxa2+": 50410,
  "Ncxa3": 55676,
  "Ncxa4": 52984,
  "Ncxa4+": 57931,
  "Ncxa5": 50525,
  "Ncxa6": 53438,
  "Ncxa7": 54945,
  "Ncxa7+": 59767,
  "Ncxa8": 53128,
  "Ncxb1": 51938,
  "Ncxb2": 56712,
  "Ncxb2+": 59260,
  "Ncxb3": 52447,
  "Ncxb3+": 55324,
  "Ncxb4": 51251,
  "Ncxb4+": 61258,
  "Ncxb5": 60290,
  "Ncxb5+": 53570,
  "Ncxb6": 57001,
  "Ncxb6#": 56047,
  "Ncxb6+": 54617,
  "Ncxb7": 55593,
  "Ncxb8": 50847,
  "Ncxd1": 60582,
  "Ncxd2": 50538,
  "Ncxd2+": 59023,
  "Ncxd3": 53057,
  "Ncxd3+": 59197,
  "Ncxd4": 53706,
  "Ncxd4+": 59615,
  "Ncxd5": 56396,
  "Ncxd5+": 53734,
  "Ncxd6": 55346,
  "Ncxd6+": 60122,
  "Ncxd7": 62090,
  "Ncxd7+": 54971,
  "Ncxd8": 53023,
  "Ncxe1": 52139,
  "Ncxe2": 52486,
  "Ncxe2+": 61046,
  "Ncxe3": 53616,
  "Ncxe3+": 60262,
  "Ncxe4": 52130,
  "Ncxe4#": 61707,
  "Ncxe4+": 61837,
  "Ncxe5": 55276,
  "Ncxe5#": 55186,
  "Ncxe5+": 53804,
  "Ncxe6": 59627,
  "Ncxe6+": 59406,
  "Ncxe7": 53955,
  "Ncxe7+": 50333,
  "Ncxe8": 61114,
  "Nd1": 59407,
  "Nd1#": 57661,
  "Nd1+": 61874,
  "Nd2": 54936,
  "Nd2#": 52972,
  "Nd2+": 57486,
  "Nd3": 52382,
  "Nd3#": 54285,
  "Nd3+": 61226,
  "Nd4": 60296,
  "Nd4#": 54022,
  "Nd4+": 55329,
  "Nd5": 52008,
  "Nd5#": 60113,
  "Nd5+": 53581,
  "Nd6": 54960,
  "Nd6#": 56170,
  "Nd6+": 61796,
  "Nd7": 54131,
  "Nd7#": 52410,
  "Nd7+": 60884,
  "Nd8": 54739,
  "Nd8#": 55269,
  "Nd8+": 57648,
  "Ndb1": 61415,
  "Ndb2": 52225,
  "Ndb2+": 56642,
  "Ndb3": 53382,
  "Ndb3+": 59315,
  "Ndb4": 61863,
  "Ndb4+": 57171,
  "Ndb5": 50906,
  "Ndb5#": 51039,
  "Ndb5+": 51729,
  "Ndb6": 58139,
  "Ndb6#": 59055,
  "Ndb6+": 50757,
  "Ndb7": 53507,
  "Ndb7+": 52921,
  "Ndb8": 54225,
  "Ndc1": 58922,
  "Ndc2": 51264,
  "Ndc2#": 59970,
  "Ndc2+": 61745,
  "Ndc3": 51431,
  "Ndc3+": 53941,
  "Ndc4": 60448,
  "Ndc4#": 53302,
  "Ndc4+": 55701,
  "Ndc5": 56196,
  "Ndc5#": 58442,
  "Ndc5+": 52863,
  "Ndc6": 55959,
  "Ndc6#": 52576,
  "Ndc6+": 61163,
  "Ndc7": 56134,
  "Ndc7#": 61888,
  "Ndc7+": 61905,
  "Ndc8": 55865,
  "Ndc8+": 61209,
  "Nde1": 52756,
  "Nde1+": 58896,
  "Nde2": 54124,
  "Nde2#": 61717,
  "Nde2+": 53830,
  "Nde3": 52353,
  "Nde3#": 56969,
  "Nde3+": 52450,
  "Nde4": 61667,
  "Nde4#": 56365,
  "Nde4+": 55684,
  "Nde5": 53728,
  "Nde5+": 54222,
  "Nde6": 56722,
  "Nde6#": 59246,
  "Nde6+": 59291,
  "Nde7": 55447,
  "Nde7#": 53465,
  "Nde7+": 54444,
  "Nde8": 50808,
  "Nde8#": 50962,
  "Nde8+": 59017,
  "Ndf1": 53928,
  "Ndf1#": 54599,
  "Ndf2": 59950,
  "Ndf2#": 57926,
  "Ndf2+": 51983,
  "Ndf3": 60793,
  "Ndf3#": 56824,
  "Ndf3+": 57121,
  "Ndf4": 51760,
  "Ndf4#": 57003,
  "Ndf4+": 58005,
  "Ndf5": 61449,
  "Ndf5#": 50697,
  "Ndf5+": 58725,
  "Ndf6": 55790,
  "Ndf6#": 57940,
  "Ndf6+": 50780,
  "Ndf7": 57663,
  "Ndf7#": 51397,
  "Ndf7+": 51043,
  "Ndf8": 56297,
  "Ndf8+": 53122,
  "Ndxb1": 51144,
  "Ndxb2": 54361,
  "Ndxb3": 51162,
  "Ndxb3+": 52734,
  "Ndxb4": 51464,
  "Ndxb4+": 57585,
  "Ndxb5": 58372,
  "Ndxb5+": 59589,
  "Ndxb6": 62133,
  "Ndxb6+": 58959,
  "Ndxb7": 58160,
  "Ndxb8": 51970,
  "Ndxc1": 57025,
  "Ndxc2": 51304,
  "Ndxc2+": 53559,
  "Ndxc3": 59380,
  "Ndxc3+": 61793,
  "Ndxc4": 61974,
  "Ndxc4+": 54856,
  "Ndxc5": 59129,
  "Ndxc5+": 56616,
  "Ndxc6": 60180,
  "Ndxc6+": 56277,
  "Ndxc7": 59906,
  "Ndxc7+": 53657,
  "Ndxc8": 60878,
  "Ndxe1": 60751,
  "Ndxe2": 57762,
  "Ndxe2#": 56459,
  "Ndxe2+": 52595,
  "Ndxe3": 58419,
  "Ndxe3+": 55241,
  "Ndxe4": 55150,
  "Ndxe4+": 55374,
  "Ndxe5": 53888,
  "Ndxe5+": 59188,
  "Ndxe6": 54691,
  "Ndxe6+": 60640,
  "Ndxe7": 60983,
  "Ndxe7#": 59618,
  "Ndxe7+": 59421,
  "Ndxe8": 50892,
  "Ndxf1": 51240,
  "Ndxf2": 53283,
  "Ndxf2+": 54908,
  "Ndxf3": 61442,
  "Ndxf3+": 51221,
  "Ndxf4": 50600,
  "Ndxf4+": 59673,
  "Ndxf5": 60762,
  "Ndxf5+": 56071,
  "Ndxf6": 61391,
  "Ndxf6+": 53912,
  "Ndxf7": 58646,
  "Ndxf7#": 51699,
  "Ndxf7+": 50743,
  "Ndxf8": 53641,
  "Ne1": 54949,
  "Ne1#": 60666,
  "Ne1+": 55653,
  "Ne2": 51718,
  "Ne2#": 58266,
  "Ne2+": 61417,
  "Ne3": 58621,
  "Ne3#": 60408,
  "Ne3+": 53064,
  "Ne4": 56905,
  "Ne4#": 59438,
  "Ne4+": 54653,
  "Ne5": 57219,
  "Ne5#": 51120,
  "Ne5+": 51152,
  "Ne6": 50830,
  "Ne6#": 58913,
  "Ne6+": 55652,
  "Ne7": 56595,
  "Ne7#": 61111,
  "Ne7+": 55507,
  "Ne8": 53800,
  "Ne8#": 60466,
  "Ne8+": 55315,
  "Nec1": 50370,
  "Nec2": 56695,
  "Nec2#": 51045,
  "Nec2+": 59021,
  "Nec3": 59397,
  "Nec3+": 50902,
  "Nec4": 54113,
  "Nec4+": 60378,
  "Nec5": 55041,
  "Nec5#": 52059,
  "Nec5+": 53719,
  "Nec6": 54475,
  "Nec6#": 51854,
  "Nec6+": 60243,
  "Nec7": 52971,
  "Nec7#": 52706,
  "Nec7+": 60644,
  "Nec8": 53327,
  "Nec8#": 54639,
  "Ned1": 58952,
  "Ned1+": 57583,
  "Ned2": 57392,
  "Ned2#": 57844,
  "Ned2+": 55929,
  "Ned3": 51358,
  "Ned3+": 56458,
  "Ned4": 50345,
  "Ned4#": 57305,
  "Ned4+": 52900,
  "Ned5": 50263,
  "Ned5+": 55924,
  "Ned6": 58673,
  "Ned6#": 56219,
  "Ned6+": 58506,
  "Ned7": 56701,
  "Ned7#": 60967,
  "Ned7+": 54953,
  "Ned8": 56680,
  "Ned8+": 51723,
  "Nef1": 56107,
  "Nef1+": 51907,
  "Nef2": 54523,
  "Nef2#": 61263,
  "Nef2+": 51033,
  "Nef3": 52625,
  "Nef3#": 56029,
  "Nef3+": 54948,
  "Nef4": 58034,
  "Nef4#": 60650,
  "Nef4+": 51158,
  "Nef5": 50304,
  "Nef5#": 59334,
  "Nef5+": 58152,
  "Nef6": 61120,
  "Nef6#": 51330,
  "Nef6+": 61983,
  "Nef7": 52188,
  "Nef7#": 56497,
  "Nef7+": 55089,
  "Nef8": 60115,
  "Nef8+": 60273,
  "Neg1": 50800,
  "Neg1#": 56127,
  "Neg1+": 55878,
  "Neg2": 54324,
  "Neg2+": 55757,
  "Neg3": 50981,
  "Neg3#": 51445,
  "Neg3+": 60007,
  "Neg4": 58530,
  "Neg4#": 50450,
  "Neg4+": 60663,
  "Neg5": 54649,
  "Neg5#": 55184,
  "Neg5+": 61851,
  "Neg6": 60151,
  "Neg6#": 58408,
  "Neg6+": 60512,
  "Neg7": 55497,
  "Neg7+": 55672,
  "Neg8": 59530,
  "Neg8+": 51030,
  "Nexc1": 59217,
  "Nexc2": 58796,
  "Nexc2+": 53312,
  "Nexc3": 53287,
  "Nexc3+": 59123,
  "Nexc4": 56043,
  "Nexc4#": 53339,
  "Nexc4+": 55601,
  "Nexc5": 57472,
  "Nexc5+": 51499,
  "Nexc6": 62116,
  "Nexc6+": 57670,
  "Nexc7": 54529,
  "Nexc7+": 58471,
  "Nexc8": 61695,
  "Nexd1": 51237,
  "Nexd2": 54638,
  "Nexd2+": 56345,
  "Nexd3": 56126,
  "Nexd3+": 55939,
  "Nexd4": 54641,
  "Nexd4+": 52317,
  "Nexd5": 57575,
  "Nexd5+": 61742,
  "Nexd6": 59329,
  "Nexd6+": 58624,
  "Nexd7": 60294,
  "Nexd7+": 52968,
  "Nexd8": 51782,
  "Nexf1": 54155,
  "Nexf2": 58929,
  "Nexf2+": 61616,
  "Nexf3": 55340,
  "Nexf3+": 59527,
  "Nexf4": 55364,
  "Nexf4+": 56222,
  "Nexf5": 50520,
  "Nexf5+": 58325,
  "Nexf6": 51378,
  "Nexf6+": 59313,
  "Nexf7": 51593,
  "Nexf7#": 54910,
  "Nexf7+": 57506,
  "Nexf8": 56098,
  "Nexg1": 60831,
  "Nexg2": 54188,
  "Nexg3": 61961,
  "Nexg3#": 58603,
  "Nexg3+": 60517,
  "Nexg4": 59905,
  "Nexg4+": 52684,
  "Nexg5": 57344,
  "Nexg5#": 56236,
  "Nexg5+": 60013,
  "Nexg6": 60250,
  "Nexg6+": 54841,
  "Nexg7": 57539,
  "Nexg7+": 55846,
  "Nexg8": 55845,
  "Nf1": 56417,
  "Nf1#": 52446,
  "Nf1+": 53055,
  "Nf2": 52860,
  "Nf2#": 50517,
  "Nf2+": 61694,
  "Nf3": 53877,
  "Nf3#": 61087,
  "Nf3+": 60550,
  "Nf4": 56223,
  "Nf4#": 59755,
  "Nf4+": 61579,
  "Nf5": 54277,
  "Nf5#": 50480,
  "Nf5+": 60203,
  "Nf6": 51127,
  "Nf6#": 51013,
  "Nf6+": 59837,
  "Nf7": 60965,
  "Nf7#": 53249,
  "Nf7+": 51624,
  "Nf8": 53322,
  "Nf8#": 53151,
  "Nf8+": 60119,
  "Nfd1": 52155,
  "Nfd2": 51324,
  "Nfd2#": 55807,
  "Nfd2+": 55163,
  "Nfd3": 57925,
  "Nfd3+": 59616,
  "Nfd4": 52944,
  "Nfd4#": 61596,
  "Nfd4+": 52150,
  "Nfd5": 55867,
  "Nfd5#": 54193,
  "Nfd5+": 59473,
  "Nfd6": 55825,
  "Nfd6#": 60107,
  "Nfd6+": 55494,
  "Nfd7": 55477,
  "Nfd7+": 58614,
  "Nfd8": 50356,
  "Nfd8+": 50841,
  "Nfe1": 60812,
  "Nfe1+": 55336,
  "Nfe2": 56363,
  "Nfe2#": 54045,
  "Nfe2+": 56109,
  "Nfe3": 51389,
  "Nfe3#": 53192,
  "Nfe3+": 57091,
  "Nfe4": 51441,
  "Nfe4#": 57747,
  "Nfe4+": 57698,
  "Nfe5": 56519,
  "Nfe5#": 57023,
  "Nfe5+": 57960,
  "Nfe6": 57368,
  "Nfe6+": 61237,
  "Nfe7": 61043,
  "Nfe7#": 55046,
  "Nfe7+": 58316,
  "Nfe8": 52722,
  "Nfe8+": 54428,
  "Nfg1": 52966,
  "Nfg2": 52100,
  "Nfg2#": 53062,
  "Nfg2+": 56964,
  "Nfg3": 61470,
  "Nfg3#": 60925,
  "Nfg3+": 51117,
  "Nfg4": 54934,
  "Nfg4#": 55438,
  "Nfg4+": 53818,
  "Nfg5": 59882,
  "Nfg5#": 55176,
  "Nfg5+": 50628,
  "Nfg6": 60473,
  "Nfg6#": 54632,
  "Nfg6+": 58692,
  "Nfg7": 52651,
  "Nfg7#": 53863,
  "Nfg7+": 53260,
  "Nfg8": 57211,
  "Nfh1": 59800,
  "Nfh2": 53267,
  "Nfh3": 53137,
  "Nfh3+": 57594,
  "Nfh4": 55233,
  "Nfh4+": 53509,
  "Nfh5": 56375,
  "Nfh5+": 57382,
  "Nfh6": 60322,
  "Nfh6+": 59941,
  "Nfh7": 51711,
  "Nfh7#": 53845,
  "Nfh7+": 58797,
  "Nfh8": 60625,
  "Nfxd1": 55469,
  "Nfxd2": 62106,
  "Nfxd3": 52590,
  "Nfxd3+": 56566,
  "Nfxd4": 51878,
  "Nfxd4#": 58945,
  "Nfxd4+": 61798,
  "Nfxd5": 50916,
  "Nfxd5+": 61379,
  "Nfxd6": 57535,
  "Nfxd6+": 61792,
  "Nfxd7": 59849,
  "Nfxd7+": 58545,
  "Nfxd8": 59775,
  "Nfxe1": 62129,
  "Nfxe2": 57340,
  "Nfxe2+": 59754,
  "Nfxe3": 51958,
  "Nfxe3+": 52642,
  "Nfxe4": 59475,
  "Nfxe4+": 56273,
  "Nfxe5": 53173,
  "Nfxe5+": 54348,
  "Nfxe6": 54140,
  "Nfxe6+": 55367,
  "Nfxe7": 50895,
  "Nfxe7+": 56814,
  "Nfxe8": 57837,
  "Nfxg1": 51228,
  "Nfxg2": 61446,
  "Nfxg2+": 50689,
  "Nfxg3": 51429,
  "Nfxg3#": 54402,
  "Nfxg3+": 53442,
  "Nfxg4": 60435,
  "Nfxg4+": 61693,
  "Nfxg5": 61814,
  "Nfxg5+": 57234,
  "Nfxg6": 51710,
  "Nfxg6+": 53600,
  "Nfxg7": 51781,
  "Nfxg7+": 52523,
  "Nfxg8": 51403,
  "Nfxh2": 59993,
  "Nfxh2+": 53009,
  "Nfxh3": 50961,
  "Nfxh3+": 58573,
  "Nfxh4": 61205,
  "Nfxh4+": 52133,
  "Nfxh5": 55189,
  "Nfxh5+": 61823,
  "Nfxh6": 54174,
  "Nfxh6+": 58018,
  "Nfxh7": 54087,
  "Nfxh7+": 51705,
  "Nfxh8": 57529,
  "Ng1": 52551,
  "Ng1#": 60850,
  "Ng1+": 54023,
  "Ng2": 61510,
  "Ng2#": 58709,
  "Ng2+": 59383,
  "Ng3": 58678,
  "Ng3#": 52613,
  "Ng3+": 59463,
  "Ng4": 52270,
  "Ng4#": 57274,
  "Ng4+": 50603,
  "Ng5": 55895,
  "Ng5#": 61370,
  "Ng5+": 60699,
  "Ng6": 50822,
  "Ng6#": 51569,
  "Ng6+": 59010,
  "Ng7": 56723,
  "Ng7#": 53754,
  "Ng7+": 60962,
  "Ng8": 50886,
  "Ng8#": 54408,
  "Ng8+": 52567,
  "Nge1": 56202,
  "Nge2": 52889,
  "Nge2#": 54389,
  "Nge2+": 52323,
  "Nge3": 57800,
  "Nge3#": 52040,
  "Nge3+": 52970,
  "Nge4": 58622,
  "Nge4#": 58182,
  "Nge4+": 58166,
  "Nge5": 53441,
  "Nge5#": 60314,
  "Nge5+": 59790,
  "Nge6": 52777,
  "Nge6#": 52988,
  "Nge6+": 61004,
  "Nge7": 56152,
  "Nge7#": 55481,
  "Nge7+": 52710,
  "Nge8": 60968,
  "Ngf1": 56377,
  "Ngf1+": 59938,
  "Ngf2": 52330,
  "Ngf2#": 51886,
  "Ngf2+": 57803,
  "Ngf3": 52405,
  "Ngf3#": 61438,
  "Ngf3+": 56671,
  "Ngf4": 52940,
  "Ngf4#": 60367,
  "Ngf4+": 51232,
  "Ngf5": 57455,
  "Ngf5#": 52145,
  "Ngf5+": 57102,
  "Ngf6": 52637,
  "Ngf6#": 53617,
  "Ngf6+": 62025,
  "Ngf7": 58068,
  "Ngf7#": 53511,
  "Ngf7+": 61256,
  "Ngf8": 58811,
  "Ngf8+": 59336,
  "Ngh1": 61464,
  "Ngh2": 57756,
  "Ngh2#": 52619,
  "Ngh2+": 61261,
  "Ngh3": 61555,
  "Ngh3+": 60023,
  "Ngh4": 50580,
  "Ngh4+": 52347,
  "Ngh5": 55132,
  "Ngh5#": 51798,
  "Ngh5+": 55501,
  "Ngh6": 60999,
  "Ngh6#": 52144,
  "Ngh6+": 51284,
  "Ngh7": 56725,
  "Ngh7#": 59600,
  "Ngh7+": 60991,
  "Ngh8": 51454,
  "Ngxe1": 52435,
  "Ngxe2": 59511,
  "Ngxe2+": 51582,
  "Ngxe3": 51709,
  "Ngxe3#": 55120,
  "Ngxe3+": 51921,
  "Ngxe4": 56794,
  "Ngxe4+": 51097,
  "Ngxe5": 54888,
  "Ngxe5+": 54616,
  "Ngxe6": 52181,
  "Ngxe6+": 60911,
  "Ngxe7": 58426,
  "Ngxe7+": 55292,
  "Ngxe8": 50528,
  "Ngxf1": 53347,
  "Ngxf1+": 53814,
  "Ngxf2": 53401,
  "Ngxf2#": 57927,
  "Ngxf2+": 57475,
  "Ngxf3": 57438,
  "Ngxf3+": 57804,
  "Ngxf4": 50976,
  "Ngxf4+": 58496,
  "Ngxf5": 61526,
  "Ngxf5+": 55942,
  "Ngxf6": 54981,
  "Ngxf6+": 56091,
  "Ngxf7": 61971,
  "Ngxf7+": 54395,
  "Ngxf8": 61423,
  "Ngxh2": 53349,
  "Ngxh2#": 58754,
  "Ngxh2+": 55524,
  "Ngxh3": 52895,
  "Ngxh3+": 60392,
  "Ngxh4": 51638,
  "Ngxh4+": 60268,
  "Ngxh5": 57679,
  "Ngxh5+": 61063,
  "Ngxh6": 55875,
  "Ngxh6+": 52047,
  "Ngxh7": 55326,
  "Ngxh7#": 61041,
  "Ngxh7+": 56455,
  "Nh1": 59729,
  "Nh1#": 53153,
  "Nh1+": 53902,
  "Nh2": 60981,
  "Nh2#": 56486,
  "Nh2+": 60604,
  "Nh3": 56038,
  "Nh3#": 60348,
  "Nh3+": 58876,
  "Nh4": 53289,
  "Nh4#": 59085,
  "Nh4+": 50650,
  "Nh5": 52541,
  "Nh5#": 51510,
  "Nh5+": 60048,
  "Nh6": 57660,
  "Nh6#": 51653,
  "Nh6+": 57932,
  "Nh7": 57639,
  "Nh7#": 58696,
  "Nh7+": 54786,
  "Nh8": 60486,
  "Nh8#": 60882,
  "Nh8+": 53995,
  "Nhf1": 60985,
  "Nhf2": 58363,
  "Nhf2#": 52273,
  "Nhf2+": 50514,
  "Nhf3": 58472,
  "Nhf3#": 62115,
  "Nhf3+": 61817,
  "Nhf4": 52783,
  "Nhf4#": 58421,
  "Nhf4+": 53093,
  "Nhf5": 62049,
  "Nhf5#": 55673,
  "Nhf5+": 50889,
  "Nhf6": 53366,
  "Nhf6#": 59224,
  "Nhf6+": 51616,
  "Nhf7": 53679,
  "Nhf7#": 61606,
  "Nhf7+": 59321,
  "Nhf8": 53458,
  "Nhg1": 61488,
  "Nhg2": 56504,
  "Nhg2#": 55742,
  "Nhg2+": 60337,
  "Nhg3": 59862,
  "Nhg3#": 55023,
  "Nhg3+": 58020,
  "Nhg4": 57815,
  "Nhg4+": 53843,
  "Nhg5": 51061,
  "Nhg5+": 53631,
  "Nhg6": 61611,
  "Nhg6#": 60278,
  "Nhg6+": 51078,
  "Nhg7": 55396,
  "Nhg7+": 58216,
  "Nhg8": 54728,
  "Nhxf1": 52922,
  "Nhxf1+": 60979,
  "Nhxf2": 56679,
  "Nhxf2#": 56382,
  "Nhxf2+": 57353,
  "Nhxf3": 55064,
  "Nhxf3+": 51977,
  "Nhxf4": 59829,
  "Nhxf4+": 60542,
  "Nhxf5": 56784,
  "Nhxf5+": 60656,
  "Nhxf6": 56776,
  "Nhxf6+": 60283,
  "Nhxf7": 55609,
  "Nhxf7+": 56034,
  "Nhxf8": 50910,
  "Nhxg1": 60532,
  "Nhxg2": 55890,
  "Nhxg3": 56938,
  "Nhxg3+": 57304,
  "Nhxg4": 57126,
  "Nhxg4+": 54432,
  "Nhxg5": 56706,
  "Nhxg5+": 52219,
  "Nhxg6": 52580,
  "Nhxg6#": 55334,
  "Nhxg6+": 53810,
  "Nhxg7": 55536,
  "Nhxg7+": 52261,
  "Nhxg8": 51802,
  "Nxa1": 60616,
  "Nxa1#": 59496,
  "Nxa1+": 50967,
  "Nxa2": 54082,
  "Nxa2#": 56221,
  "Nxa2+": 61338,
  "Nxa3": 53598,
  "Nxa3#": 57135,
  "Nxa3+": 51494,
  "Nxa4": 57250,
  "Nxa4#": 52808,
  "Nxa4+": 54923,
  "Nxa5": 61655,
  "Nxa5#": 59718,
  "Nxa5+": 52359,
  "Nxa6": 54690,
  "Nxa6#": 52073,
  "Nxa6+": 58112,
  "Nxa7": 50335,
  "Nxa7#": 53323,
  "Nxa7+": 51536,
  "Nxa8": 59005,
  "Nxa8#": 50923,
  "Nxa8+": 60866,
  "Nxb1": 55355,
  "Nxb1#": 56716,
  "Nxb1+": 54695,
  "Nxb2": 54276,
  "Nxb2#": 61260,
  "Nxb2+": 61743,
  "Nxb3": 55553,
  "Nxb3#": 60710,
  "Nxb3+": 58841,
  "Nxb4": 51074,
  "Nxb4#": 58070,
  "Nxb4+": 50612,
  "Nxb5": 54214,
  "Nxb5#": 60986,
  "Nxb5+": 50597,
  "Nxb6": 58380,
  "Nxb6#": 53836,
  "Nxb6+": 55295,
  "Nxb7": 60881,
  "Nxb7#": 61095,
  "Nxb7+": 51075,
  "Nxb8": 53575,
  "Nxb8#": 56943,
  "Nxb8+": 61528,
  "Nxc1": 57589,
  "Nxc1#": 60414,
  "Nxc1+": 61254,
  "Nxc2": 54417,
  "Nxc2#": 52961,
  "Nxc2+": 61770,
  "Nxc3": 53903,
  "Nxc3#": 56402,
  "Nxc3+": 52800,
  "Nxc4": 56724,
  "Nxc4#": 51109,
  "Nxc4+": 53452,
  "Nxc5": 60826,
  "Nxc5#": 61493,
  "Nxc5+": 52887,
  "Nxc6": 51923,
  "Nxc6#": 56654,
  "Nxc6+": 53695,
  "Nxc7": 53537,
  "Nxc7#": 57753,
  "Nxc7+": 58296,
  "Nxc8": 50887,
  "Nxc8#": 50705,
  "Nxc8+": 61344,
  "Nxd1": 60972,
  "Nxd1#": 61181,
  "Nxd1+": 51461,
  "Nxd2": 60629,
  "Nxd2#": 55143,
  "Nxd2+": 51318,
  "Nxd3": 54508,
  "Nxd3#": 51184,
  "Nxd3+": 55430,
  "Nxd4": 54182,
  "Nxd4#": 56833,
  "Nxd4+": 52660,
  "Nxd5": 50797,
  "Nxd5#": 60376,
  "Nxd5+": 57514,
  "Nxd6": 52620,
  "Nxd6#": 60874,
  "Nxd6+": 58341,
  "Nxd7": 55078,
  "Nxd7#": 53986,
  "Nxd7+": 51806,
  "Nxd8": 52638,
  "Nxd8#": 55405,
  "Nxd8+": 51899,
  "Nxe1": 55277,
  "Nxe1#": 53792,
  "Nxe1+": 61821,
  "Nxe2": 53125,
  "Nxe2#": 54141,
  "Nxe2+": 54392,
  "Nxe3": 55486,
  "Nxe3#": 58723,
  "Nxe3+": 51856,
  "Nxe4": 50828,
  "Nxe4#": 59226,
  "Nxe4+": 55613,
  "Nxe5": 50869,
  "Nxe5#": 57058,
  "Nxe5+": 51012,
  "Nxe6": 60102,
  "Nxe6#": 53114,
  "Nxe6+": 53637,
  "Nxe7": 59955,
  "Nxe7#": 52202,
  "Nxe7+": 56224,
  "Nxe8": 61719,
  "Nxe8#": 51658,
  "Nxe8+": 58304,
  "Nxf1": 60084,
  "Nxf1#": 51280,
  "Nxf1+": 54310,
  "Nxf2": 52227,
  "Nxf2#": 53769,
  "Nxf2+": 51452,
  "Nxf3": 53878,
  "Nxf3#": 57395,
  "Nxf3+": 56773,
  "Nxf4": 55307,
  "Nxf4#": 51485,
  "Nxf4+": 61746,
  "Nxf5": 60947,
  "Nxf5#": 53782,
  "Nxf5+": 61093,
  "Nxf6": 53204,
  "Nxf6#": 53040,
  "Nxf6+": 55001,
  "Nxf7": 55342,
  "Nxf7#": 57318,
  "Nxf7+": 51014,
  "Nxf8": 57581,
  "Nxf8#": 56911,
  "Nxf8+": 59564,
  "Nxg1": 53211,
  "Nxg1#": 54293,
  "Nxg1+": 62121,
  "Nxg2": 57281,
  "Nxg2#": 57998,
  "Nxg2+": 54076,
  "Nxg3": 56714,
  "Nxg3#": 58230,
  "Nxg3+": 61500,
  "Nxg4": 61324,
  "Nxg4#": 55999,
  "Nxg4+": 53004,
  "Nxg5": 50431,
  "Nxg5#": 61307,
  "Nxg5+": 57363,
  "Nxg6": 59942,
  "Nxg6#": 60660,
  "Nxg6+": 60090,
  "Nxg7": 56703,
  "Nxg7#": 52636,
  "Nxg7+": 54390,
  "Nxg8": 54042,
  "Nxg8#": 50276,
  "Nxg8+": 55268,
  "Nxh1": 58245,
  "Nxh1#": 57396,
  "Nxh1+": 55217,
  "Nxh2": 54932,
  "Nxh2#": 60713,
  "Nxh2+": 56330,
  "Nxh3": 52263,
  "Nxh3#": 58613,
  "Nxh3+": 50466,
  "Nxh4": 50571,
  "Nxh4#": 60457,
  "Nxh4+": 51818,
  "Nxh5": 61578,
  "Nxh5#": 52749,
  "Nxh5+": 56827,
  "Nxh6": 60702,
  "Nxh6#": 56129,
  "Nxh6+": 52224,
  "Nxh7": 60971,
  "Nxh7#": 52550,
  "Nxh7+": 60027,
  "Nxh8": 55891,
  "Nxh8#": 57982,
  "Nxh8+": 60401,
  "O-O": 60891,
  "O-O#": 50530,
  "O-O+": 51726,
  "O-O-O": 57626,
  "O-O-O#": 55489,
  "O-O-O+": 55255,
  "Q1a1": 60474,
  "Q1a1#": 56854,
  "Q1a1+": 59311,
  "Q1a2": 56399,
  "Q1a2#": 54086,
  "Q1a2+": 55122,
  "Q1a3#": 61910,
  "Q1a3+": 53236,
  "Q1a4": 61316,
  "Q1a4+": 54985,
  "Q1a5": 51952,
  "Q1a5+": 60780,
  "Q1a6": 56825,
  "Q1a6+": 59872,
  "Q1a7#": 52594,
  "Q1a7+": 55045,
  "Q1b1": 51102,
  "Q1b1#": 61630,
  "Q1b1+": 60477,
  "Q1b2": 51793,
  "Q1b2#": 51607,
  "Q1b2+": 56994,
  "Q1b3": 59412,
  "Q1b3#": 54322,
  "Q1b3+": 60627,
  "Q1b4": 56691,
  "Q1b4#": 52956,
  "Q1b4+": 55471,
  "Q1b5#": 56940,
  "Q1b5+": 56565,
  "Q1b6": 61736,
  "Q1b6+": 54864,
  "Q1b7": 50499,
  "Q1b7#": 57331,
  "Q1b7+": 57358,
  "Q1c1": 61252,
  "Q1c1#": 57579,
  "Q1c1+": 54570,
  "Q1c2": 54528,
  "Q1c2#": 60056,
  "Q1c2+": 50273,
  "Q1c3": 60922,
  "Q1c3#": 56650,
  "Q1c3+": 53432,
  "Q1c4": 52226,
  "Q1c4#": 51488,
  "Q1c4+": 57463,
  "Q1c5": 56464,
  "Q1c5#": 56954,
  "Q1c5+": 50397,
  "Q1c6": 53674,
  "Q1c6#": 59070,
  "Q1c6+": 60863,
  "Q1c7#": 55670,
  "Q1c7+": 55406,
  "Q1d1": 54455,
  "Q1d1#": 59901,
  "Q1d1+": 54877,
  "Q1d2": 54175,
  "Q1d2#": 52258,
  "Q1d2+": 56871,
  "Q1d3": 61545,
  "Q1d3#": 50621,
  "Q1d3+": 53390,
  "Q1d4": 51625,
  "Q1d4#": 54763,
  "Q1d4+": 54359,
  "Q1d5": 52888,
  "Q1d5#": 56411,
  "Q1d5+": 58099,
  "Q1d6+": 51829,
  "Q1d7": 60941,
  "Q1d7#": 54918,
  "Q1d7+": 58918,
  "Q1e1": 55802,
  "Q1e1#": 58879,
  "Q1e1+": 53541,
  "Q1e2": 50637,
  "Q1e2#": 55436,
  "Q1e2+": 56228,
  "Q1e3": 56340,
  "Q1e3#": 51744,
  "Q1e3+": 51130,
  "Q1e4": 51787,
  "Q1e4#": 51417,
  "Q1e4+": 50505,
  "Q1e5": 55776,
  "Q1e5+": 54398,
  "Q1e6#": 58199,
  "Q1e6+": 55847,
  "Q1e7#": 51518,
  "Q1e7+": 57108,
  "Q1f1": 61960,
  "Q1f1#": 50855,
  "Q1f1+": 57106,
  "Q1f2": 57792,
  "Q1f2#": 51832,
  "Q1f2+": 56280,
  "Q1f3": 52475,
  "Q1f3#": 52702,
  "Q1f3+": 60955,
  "Q1f4": 52013,
  "Q1f4#": 59392,
  "Q1f4+": 52867,
  "Q1f5": 61957,
  "Q1f5#": 50403,
  "Q1f5+": 59834,
  "Q1f6#": 54014,
  "Q1f7": 50744,
  "Q1f7#": 59688,
  "Q1g1": 53893,
  "Q1g1#": 50545,
  "Q1g1+": 58522,
  "Q1g2": 53116,
  "Q1g2#": 61840,
  "Q1g2+": 62019,
  "Q1g3": 60149,
  "Q1g3#": 57580,
  "Q1g3+": 58859,
  "Q1g4": 60308,
  "Q1g4#": 59574,
  "Q1g4+": 51982,
  "Q1g5": 51424,
  "Q1g5#": 57912,
  "Q1g5+": 54558,
  "Q1g6": 58407,
  "Q1g6#": 61581,
  "Q1g6+": 51167,
  "Q1g7": 54105,
  "Q1h1#": 58995,
  "Q1h1+": 58905,
  "Q1h2": 56317,
  "Q1h2#": 52859,
  "Q1h2+": 57976,
  "Q1h3": 51253,
  "Q1h3#": 56728,
  "Q1h3+": 50839,
  "Q1h4": 51577,
  "Q1h4#": 54468,
  "Q1h4+": 60849,
  "Q1h5#": 51959,
  "Q1h7": 57975,
  "Q1h7+": 52558,
  "Q1xa2": 53030,
  "Q1xa2+": 54426,
  "Q1xa3": 53402,
  "Q1xa3+": 50913,
  "Q1xa7#": 59281,
  "Q1xb1": 58224,
  "Q1xb1#": 55703,
  "Q1xb2": 52342,
  "Q1xb2#": 56606,
  "Q1xb2+": 58599,
  "Q1xb3+": 54703,
  "Q1xb4#": 59305,
  "Q1xb5#": 60798,
  "Q1xb5+": 56935,
  "Q1xb6+": 59124,
  "Q1xb7+": 55070,
  "Q1xc2": 56709,
  "Q1xc2#": 58391,
  "Q1xc2+": 51070,
  "Q1xc3": 57500,
  "Q1xc3#": 59151,
  "Q1xc3+": 52504,
  "Q1xc4": 52965,
  "Q1xc5+": 60368,
  "Q1xc7+": 52526,
  "Q1xd1#": 53664,
  "Q1xd1+": 59891,
  "Q1xd2": 60430,
  "Q1xd2+": 51348,
  "Q1xd3+": 57459,
  "Q1xd4": 57313,
  "Q1xd4+": 51101,
  "Q1xd6": 52639,
  "Q1xd7": 58710,
  "Q1xd7+": 53907,
  "Q1xe1#": 56646,
  "Q1xe2#": 52377,
  "Q1xe2+": 50283,
  "Q1xe3": 59693,
  "Q1xe3+": 51366,
  "Q1xe4": 53264,
  "Q1xe4+": 55123,
  "Q1xe5+": 56987,
  "Q1xe7": 54749,
  "Q1xf1#": 53331,
  "Q1xf1+": 55646,
  "Q1xf2": 52312,
  "Q1xf2+": 56159,
  "Q1xf3": 62052,
  "Q1xf3#": 59385,
  "Q1xf3+": 50569,
  "Q1xf4": 52501,
  "Q1xf4+": 59971,
  "Q1xf5": 61935,
  "Q1xf5+": 57276,
  "Q1xf6+": 54702,
  "Q1xf7+": 58277,
  "Q1xg1#": 50421,
  "Q1xg2": 58819,
  "Q1xg2#": 56218,
  "Q1xg2+": 53237,
  "Q1xg3#": 58677,
  "Q1xg3+": 61091,
  "Q1xg5#": 56334,
  "Q1xh1+": 51817,
  "Q1xh2+": 50453,
  "Q1xh3#": 59758,
  "Q1xh4": 58248,
  "Q1xh4#": 54220,
  "Q1xh6+": 52097,
  "Q2a1#": 58593,
  "Q2a2": 54612,
  "Q2a2#": 53228,
  "Q2a2+": 57104,
  "Q2a4#": 54590,
  "Q2a4+": 55976,
  "Q2a5#": 50725,
  "Q2a6+": 60681,
  "Q2a7": 58374,
  "Q2b1": 52391,
  "Q2b1+": 60316,
  "Q2b2": 51460,
  "Q2b2+": 55187,
  "Q2b3": 55159,
  "Q2b3#": 53172,
  "Q2b3+": 55733,
  "Q2b4": 54811,
  "Q2b4#": 56267,
  "Q2b4+": 56600,
  "Q2b5": 51663,
  "Q2b5#": 51357,
  "Q2b5+": 52674,
  "Q2b7": 54207,
  "Q2c1": 55153,
  "Q2c1+": 61845,
  "Q2c2": 55648,
  "Q2c2+": 52796,
  "Q2c3": 54914,
  "Q2c3#": 50943,
  "Q2c3+": 61654,
  "Q2c4": 52811,
  "Q2c4#": 58776,
  "Q2c4+": 52063,
  "Q2c5#": 59162,
  "Q2c6#": 54037,
  "Q2c7": 60910,
  "Q2c7#": 61330,
  "Q2c7+": 50753,
  "Q2d1+": 50606,
  "Q2d2": 55061,
  "Q2d2+": 55177,
  "Q2d3": 57457,
  "Q2d3#": 56942,
  "Q2d3+": 57621,
  "Q2d4": 57297,
  "Q2d4+": 58303,
  "Q2d5#": 53586,
  "Q2d5+": 60858,
  "Q2d6": 53502,
  "Q2d6+": 56292,
  "Q2d7#": 55849,
  "Q2d7+": 53780,
  "Q2e1": 52308,
  "Q2e1+": 61189,
  "Q2e2": 60704,
  "Q2e2+": 61246,
  "Q2e3": 60158,
  "Q2e3+": 56230,
  "Q2e4": 57140,
  "Q2e4#": 55651,
  "Q2e4+": 52493,
  "Q2e5": 59670,
  "Q2e5#": 57406,
  "Q2e5+": 56992,
  "Q2e6": 54039,
  "Q2e6#": 57640,
  "Q2e6+": 62065,
  "Q2e7#": 57818,
  "Q2e7+": 50527,
  "Q2f1": 52577,
  "Q2f1+": 57354,
  "Q2f2": 55749,
  "Q2f2#": 55950,
  "Q2f2+": 54515,
  "Q2f3": 58094,
  "Q2f3#": 57977,
  "Q2f3+": 56633,
  "Q2f4": 58349,
  "Q2f4#": 53608,
  "Q2f4+": 60509,
  "Q2f6": 55103,
  "Q2f6#": 53760,
  "Q2f6+": 54817,
  "Q2f7": 53913,
  "Q2f7#": 51396,
  "Q2g1": 53053,
  "Q2g1#": 61336,
  "Q2g1+": 59196,
  "Q2g2": 60108,
  "Q2g2#": 59656,
  "Q2g2+": 59465,
  "Q2g3": 59278,
  "Q2g3#": 60970,
  "Q2g3+": 52607,
  "Q2g4": 60592,
  "Q2g4#": 56201,
  "Q2g4+": 61435,
  "Q2g5#": 50486,
  "Q2g5+": 52556,
  "Q2g6+": 58512,
  "Q2g7#": 57729,
  "Q2g7+": 59175,
  "Q2h1#": 57871,
  "Q2h2": 55562,
  "Q2h2#": 50348,
  "Q2h3#": 55230,
  "Q2h3+": 56692,
  "Q2h4#": 56521,
  "Q2h4+": 58510,
  "Q2h5#": 58405,
  "Q2h5+": 52942,
  "Q2h8+": 54157,
  "Q2xa3+": 56404,
  "Q2xa4#": 61053,
  "Q2xb2#": 57767,
  "Q2xb3#": 59049,
  "Q2xb3+": 62009,
  "Q2xb4+": 59846,
  "Q2xb6": 51151,
  "Q2xb6+": 50806,
  "Q2xc2#": 53491,
  "Q2xc3": 54547,
  "Q2xc3#": 51563,
  "Q2xc3+": 61904,
  "Q2xc4": 57544,
  "Q2xc4+": 55940,
  "Q2xc5#": 53603,
  "Q2xd2+": 51564,
  "Q2xd3": 59099,
  "Q2xd3#": 58904,
  "Q2xd3+": 53144,
  "Q2xd4#": 56144,
  "Q2xd4+": 53012,
  "Q2xe2": 54708,
  "Q2xe2+": 60535,
  "Q2xe3": 52024,
  "Q2xe3+": 53043,
  "Q2xe6+": 60920,
  "Q2xf2": 59445,
  "Q2xf2+": 54273,
  "Q2xf3": 58786,
  "Q2xf3#": 53799,
  "Q2xf3+": 56525,
  "Q2xf5+": 60097,
  "Q2xg1#": 54479,
  "Q2xg2#": 55796,
  "Q2xg2+": 52949,
  "Q2xg3": 55661,
  "Q2xg3#": 56670,
  "Q2xg3+": 60127,
  "Q2xg4#": 51498,
  "Q2xg5+": 54751,
  "Q2xg6+": 58167,
  "Q2xg7#": 55285,
  "Q2xh6#": 52128,
  "Q3a1#": 50989,
  "Q3a2": 62045,
  "Q3a2#": 59931,
  "Q3a3": 60081,
  "Q3a3#": 50718,
  "Q3a3+": 56357,
  "Q3a4#": 57488,
  "Q3a5#": 53160,
  "Q3a5+": 56298,
  "Q3a6+": 54556,
  "Q3a8": 59791,
  "Q3b2": 55697,
  "Q3b2#": 57719,
  "Q3b2+": 53428,
  "Q3b3": 52253,
  "Q3b3+": 57942,
  "Q3b4": 55461,
  "Q3b4#": 54801,
  "Q3b4+": 60124,
  "Q3b5#": 56627,
  "Q3b5+": 50635,
  "Q3b6": 52630,
  "Q3b6#": 61179,
  "Q3b6+": 58663,
  "Q3b7#": 57208,
